# Aggregate, apply, and groupby - Exercises
### Exercise 1
You are again given the Titanic dataset below. What was the average age of Titanic passengers?

In [4]:
import pandas as pd

df = pd.read_csv("../data/titanic_data.csv")

df["age"].mean()

29.69911764705882

### Exercise 2
What was the median fare of Titanic passengers split by sex?

In [3]:
df.groupby("sex")["fare"].median()

sex
female    23.0
male      10.5
Name: fare, dtype: float64

### Exercise 3
What was the average and maximum age of survivors and non-survivors for each sex?

In [5]:
df.groupby(["survived", "sex"])["age"].agg(["mean", "max"])

                      mean   max
survived sex
False    female  25.046875  57.0
         male    31.618056  74.0
True     female  28.847716  63.0
         male    27.276022  80.0

### Exercise 4 - Bonus
Create a new column called "first class" that contains boolean data about whether a passenger was in the first class or in another class. What was the average age of first-class passengers vs non-first-class passengers?

In [7]:
def first_class_check(fareclass):
    if fareclass == 1:
        return True
    else:
        return False

df["first_class"] = df["class"].apply(first_class_check)
df

,survived,class,sex,age,siblings/spouses,parents/children,fare,who,embark_town,alone,first_class
0,False,3,male,22.0,1,0,7.2500,man,Southampton,False,False
1,True,1,female,38.0,1,0,71.2833,woman,Cherbourg,False,True
2,True,3,female,26.0,0,0,7.9250,woman,Southampton,True,False
3,True,1,female,35.0,1,0,53.1000,woman,Southampton,False,True
4,False,3,male,35.0,0,0,8.0500,man,Southampton,True,False
...,...,...,...,...,...,...,...,...,...,...,...
886,False,2,male,27.0,0,0,13.0000,man,Southampton,True,False
887,True,1,female,19.0,0,0,30.0000,woman,Southampton,True,True
888,False,3,female,NaN,1,2,23.4500,woman,Southampton,False,False
889,True,1,male,26.0,0,0,30.0000,man,Cherbourg,True,True
890,False,3,male,32.0,0,0,7.7500,man,Queenstown,True,False